# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\dmytro.fedorchenko\Documents\PSoC Creator\PWM01\midiPlayer.cydsn\midiPlayer.cyprj
# Date: Wed, 11 Jul 2018 19:33:37 GMT
#set_units -time ns
create_clock -name {Clock_1(FFB)} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {SPI_SCBCLK(FFB)} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {Clock_2(FFB)} -period 976.5625 -waveform {0 488.28125} [list [get_pins {ClockBlock/ff_div_4}]]
create_clock -name {UART_SCBCLK(FFB)} -period 4333.333333333333 -waveform {0 2166.66666666667} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]
create_generated_clock -name {SPI_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 47 93} -nominal_period 976.5625 [list]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 209 417} -nominal_period 4333.333333333333 [list]


# Component constraints for C:\Users\dmytro.fedorchenko\Documents\PSoC Creator\PWM01\midiPlayer.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\dmytro.fedorchenko\Documents\PSoC Creator\PWM01\midiPlayer.cydsn\midiPlayer.cyprj
# Date: Wed, 11 Jul 2018 19:33:36 GMT
